# Intro to Pandas: Series and DataFrames

In [1]:
import pandas as pd

data = [10, 20, 30, 40]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
series = pd.Series(data, index=["a", "b", "c", "d"])
series

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
data = {
    "name": ["alice", "bob", "charlie"],
    "Age": [25, 30, 35],
    "city": ["New-york", "Los-Angeles", "Chicago"],
}

df = pd.DataFrame(data)
df

      name  Age         city
0    alice   25     New-york
1      bob   30  Los-Angeles
2  charlie   35      Chicago